Revit 2024 API
DockablePaneState Constructor
 Creates a new DockablePaneState object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public DockablePaneState()
Visual Basic
Public Sub New
Visual C++
public:
DockablePaneState()
See Also
DockablePaneState Class
DockablePaneState Overload
Autodesk.Revit.UI Namespace